python/flask分析.org
#+OPTIONS: ^:nil
#+AUTHORS: linuxhui



* app.route
** app.route()函数
app.route时一个迭代器。
参数有两个: rule, **options
+ rule: 
+ options:参数

它指向了add_url_rule函数
** app.add_url_rule()函数
它外部有一个装饰器setupmethod
add_url_rule(self, rule, endpoint=None, view_func=None, **options):
view_func 就是我们定义的函数

到这里 我们就简单了解 endpoint 如果endpoint参数存在，那么endpoint为参数值，否则endpoint就是自己定义的函数的名字。

突然意识到：
@app.route('/', methods=['GET']）
def user():
    pass
和
@app.route('/'):
def user(methods=['GET']):
    pass
基本上是一样的
** run_simple(hostname, port, application, use_reloader=False,
               use_debugger=False, use_evalex=True,
               extra_files=None, reloader_interval=1,
               reloader_type='auto', threaded=False, processes=1,
               request_handler=None, static_files=None,
               passthrough_errors=False, ssl_context=None):

第三位是flask的app， 我们应该找出它什么时候被调用了。才能找出__call__被调用的时候。
** 调用的是make_server(host, port, app=None, threaded=False, processes=1,
                request_handler=None, passthrough_errors=False,
                ssl_context=None)
** BaseWSGIServer(HTTPServer, object):
x







* Endpoint
http://www.druva.com/blog/simple-definition-endpoint/
* WSGI

* 服务的启动过程分析

** socketserver源码分析

** 一个完整的启动过程分析

** 在werkzeug中 socketserver



* python的socketserver编程

** python的socket简单了解
这个部分参考: http://blog.csdn.net/rebelqsp/article/details/

*** socket 类型 
套结字格式:
*socket(family,type[,protocal])*  使用给定的地址族、套接字类型、协议编号（默认为0）来创建套接字。

| socket类型            | 描述                                                                                                                                                                             |
|-----------------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| socket.AF_UNIX        | 只能用于单一的unix系统进程剑通信                                                                                                                                                 |
| socket.AF_INET        | 服务器之间的网络通信                                                                                                                                                             |
| socket.AF_INET6       | IPV6                                                                                                                                                                             |
| socket.SOCK_STREAM    | 流式socket,for tcp                                                                                                                                                               |
| socket.SOCK_DGRAM     | 数据报式, for UDP                                                                                                                                                                |
| socket.SOCK_RAW       | 原始套接字，普通的套接字无法处理ICMP、IGMP等网络报文，而SOCK_RAW可以；其次，SOCK_RAW也可以处理特殊的IPv4报文；此外，利用原始套接字，可以通过IP_HDRINCL套接字选项由用户构造IP头。 |
| socket.SOCK_SEQPACKET | 可靠的连续数据包服务                                                                                                                                                             |

创建socket的一般形式:
+ 创建TCP Socket:
  s=socket.socket(socket.AF_INET,socket.SOCK_STREAM)
+  创建UDP Socket：
  s=socket.socket(socket.AF_INET,socket.SOCK_DGRAM)

