python/flask分析.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>flask分析</title>
<!-- 2015-11-30 一 10:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="huihui" />
</head>
<body>
<div id="content">
<h1 class="title">flask分析</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. app.route</a>
<ul>
<li><a href="#sec-1-1">1.1. app.route()函数</a></li>
<li><a href="#sec-1-2">1.2. app.add_url_rule()函数</a></li>
<li><a href="#sec-1-3">1.3. run_simple(hostname, port, application, use_reloader=False,</a></li>
<li><a href="#sec-1-4">1.4. 调用的是make_server(host, port, app=None, threaded=False, processes=1,</a></li>
<li><a href="#sec-1-5">1.5. BaseWSGIServer(HTTPServer, object):</a></li>
</ul>
</li>
<li><a href="#sec-2">2. WSGI</a></li>
<li><a href="#sec-3">3. 服务的启动过程分析</a>
<ul>
<li><a href="#sec-3-1">3.1. socketserver源码分析</a></li>
<li><a href="#sec-3-2">3.2. 一个完整的启动过程分析</a></li>
<li><a href="#sec-3-3">3.3. 在werkzeug中 socketserver</a></li>
</ul>
</li>
<li><a href="#sec-4">4. python的socketserver编程</a>
<ul>
<li><a href="#sec-4-1">4.1. python的socket简单了解</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. socket 类型</a></li>
<li><a href="#sec-4-1-2">4.1.2. Socket函数</a></li>
<li><a href="#sec-4-1-3">4.1.3. socket 编程思路</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. python的socketserver学习</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. server 创建指导</a></li>
<li><a href="#sec-4-2-2">4.2.2. server 对象</a></li>
<li><a href="#sec-4-2-3">4.2.3. 请求处理对象</a></li>
<li><a href="#sec-4-2-4">4.2.4. socketserver实现:</a></li>
<li><a href="#sec-4-2-5">4.2.5. 代码解析</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> app.route</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> app.route()函数</h3>
<div class="outline-text-3" id="text-1-1">
<p>
app.route时一个迭代器。
参数有两个: rule, **options
</p>
<ul class="org-ul">
<li>rule: 
</li>
<li>options:参数
</li>
</ul>

<p>
它指向了add_url_rule函数
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> app.add_url_rule()函数</h3>
<div class="outline-text-3" id="text-1-2">
<p>
它外部有一个装饰器setupmethod
add_url_rule(self, rule, endpoint=None, view_func=None, **options):
view_func 就是我们定义的函数
</p>

<p>
到这里 我们就简单了解 endpoint 如果endpoint参数存在，那么endpoint为参数值，否则endpoint就是自己定义的函数的名字。
</p>

<p>
突然意识到：
@app.route('/', methods=['GET']）
def user():
    pass
和
@app.route('/'):
def user(methods=['GET']):
    pass
基本上是一样的
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> run_simple(hostname, port, application, use_reloader=False,</h3>
<div class="outline-text-3" id="text-1-3">
<p>
use_debugger=False, use_evalex=True,
extra_files=None, reloader_interval=1,
reloader_type='auto', threaded=False, processes=1,
request_handler=None, static_files=None,
passthrough_errors=False, ssl_context=None):
</p>

<p>
第三位是flask的app， 我们应该找出它什么时候被调用了。才能找出__call__被调用的时候。
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 调用的是make_server(host, port, app=None, threaded=False, processes=1,</h3>
<div class="outline-text-3" id="text-1-4">
<p>
request_handler=None, passthrough_errors=False,
ssl_context=None)
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> BaseWSGIServer(HTTPServer, object):</h3>
<div class="outline-text-3" id="text-1-5">
<p>
x
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> WSGI</h2>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 服务的启动过程分析</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> socketserver源码分析</h3>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 一个完整的启动过程分析</h3>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 在werkzeug中 socketserver</h3>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> python的socketserver编程</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> python的socket简单了解</h3>
<div class="outline-text-3" id="text-4-1">
<p>
这个部分参考: <a href="http://blog.csdn.net/rebelqsp/article/details/">http://blog.csdn.net/rebelqsp/article/details/</a>
</p>
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> socket 类型</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
套结字格式:
<b>socket(family,type[,protocal])</b>  使用给定的地址族、套接字类型、协议编号（默认为0）来创建套接字。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">socket类型</th>
<th scope="col" class="left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">socket.AF_UNIX</td>
<td class="left">只能用于单一的unix系统进程剑通信</td>
</tr>

<tr>
<td class="left">socket.AF_INET</td>
<td class="left">服务器之间的网络通信</td>
</tr>

<tr>
<td class="left">socket.AF_INET6</td>
<td class="left">IPV6</td>
</tr>

<tr>
<td class="left">socket.SOCK_STREAM</td>
<td class="left">流式socket,for tcp</td>
</tr>

<tr>
<td class="left">socket.SOCK_DGRAM</td>
<td class="left">数据报式, for UDP</td>
</tr>

<tr>
<td class="left">socket.SOCK_RAW</td>
<td class="left">原始套接字，普通的套接字无法处理ICMP、IGMP等网络报文，而SOCK_RAW可以；其次，SOCK_RAW也可以处理特殊的IPv4报文；此外，利用原始套接字，可以通过IP_HDRINCL套接字选项由用户构造IP头。</td>
</tr>

<tr>
<td class="left">socket.SOCK_SEQPACKET</td>
<td class="left">可靠的连续数据包服务</td>
</tr>
</tbody>
</table>

<p>
创建socket的一般形式:
</p>
<ul class="org-ul">
<li>创建TCP Socket:
s=socket.socket(socket.AF_INET,socket.SOCK_STREAM)
</li>
<li>创建UDP Socket：
s=socket.socket(socket.AF_INET,socket.SOCK_DGRAM)
</li>
</ul>
</div>
</div>
