python/flask分析.org
*** Socket函数
+ 服务端函数
  | 函数              | 描述                                                                                                                       |
  |-------------------+----------------------------------------------------------------------------------------------------------------------------|
  | s.bind(address)   | 将套结字绑定到地址,在AF_INET,以元素(host,port)的形式表示地址                                                               |
  | s.listen(backlog) | 开始监听TCP传入连接。backlog指定在拒绝连接之前，操作系统可以挂起的最大连接数量。该值至少为1，大部分应用程序设为5就可以了。 |
  | s.accept()        |  接受TCP连接并返回（conn,address）,其中conn是新的套接字对象，可以用来接收和发送数据。address是连接客户端的地址。                                                                                                                           |

+ 客户端函数
  | 函数               | 描述                                                                                           |
  |--------------------+------------------------------------------------------------------------------------------------|
  | s.connect(address) | 连接到address的套接字,一般address的格式为元组(hostname,port),如果链接出错,返回socket.error错误 |
  | s.connect_ex(address)      | 功能与connect(address)相同,但是成功返回0.失败返回error的值                                                      |

+ 公共socket函数
  | 函数                                 | 描述                                                                                                                                                                                |
  |--------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
  | s.recv(bufsize[,flag])               | 接受TCP套接字的数据。数据以字符串形式返回，bufsize指定要接收的最大数据量。flag提供有关消息的其他信息，通常可以忽略。                                                                |
  | s.send(string[,flag])                | 发送TCP数据。将string中的数据发送到连接的套接字。返回值是要发送的字节数量，该数量可能小于string的字节大小。                                                                         |
  | s.sendall(string[,flag])             | 	完整发送TCP数据。将string中的数据发送到连接的套接字，但在返回之前会尝试发送所有数据。成功返回None，失败则抛出异常。                                                               |
  | s.recvfrom(bufsize[.flag])           | 	接受UDP套接字的数据。与recv()类似，但返回值是（data,address）。其中data是包含接收数据的字符串，address是发送数据的套接字地址。                                                    |
  | s.sendto(string[,flag],address)      | 发送UDP数据。将数据发送到套接字，address是形式为（ipaddr，port）的元组，指定远程地址。返回值是发送的字节数。                                                                        |
  | s.close()                            | 	关闭套接字。                                                                                                                                                                      |
  | s.getpeername()                      | 返回连接套接字的远程地址。返回值通常是元组（ipaddr,port）。                                                                                                                         |
  | s.getsockname()                      | 返回套接字自己的地址。通常是一个元组(ipaddr,port)                                                                                                                                   |
  | s.setsockopt(level,optname,value)    | 	设置给定套接字选项的值。                                                                                                                                                          |
  | s.getsockopt(level,optname[.buflen]) | 返回套接字选项的值。                                                                                                                                                                |
  | s.settimeout(timeout)                | 设置套接字操作的超时期，timeout是一个浮点数，单位是秒。值为None表示没有超时期。一般，超时期应该在刚创建套接字时设置，因为它们可能用于连接的操作（如connect()）                      |
  | s.gettimeout()                       | 返回当前超时期的值，单位是秒，如果没有设置超时期，则返回None。                                                                                                                      |
  | s.fileno()                           | 返回套接字的文件描述符。                                                                                                                                                            |
  | s.setblocking(flag)                  | 如果flag为0，则将套接字设为非阻塞模式，否则将套接字设为阻塞模式（默认值）。非阻塞模式下，如果调用recv()没有发现任何数据，或send()调用无法立即发送数据，那么将引起socket.error异常。 |
  | s.makefile()                         |    	创建一个与该套接字相关连的文件                                                                                                                                                                                  |

*** socket 编程思路
**** tcp服务器端
1. 创建套接字,绑定套接字到本地IP与端口
   #+BEGIN_SRC python
        socket.socket(socket.AF_INET,socket.SOCK_STREAM) , s.bind()
   #+END_SRC
2. 开始监听链接
   #+BEGIN_SRC python
        s.listen()
   #+END_SRC
3. 进入循环,不断接受客户端的连接请求
   #+BEGIN_SRC python
        s.accept()
   #+END_SRC
4. 然后接收传来的数据,并发送给对方数据
   #+BEGIN_SRC python
        s.recv() , s.sendall()
   #+END_SRC
5. 传输完毕后,关闭套接字
   #+BEGIN_SRC python
        s.close()
   #+END_SRC
**** TCP 客户端
1. 创建套接字，连接远端地址
    #+BEGIN_SRC python
          socket.socket(socket.AF_INET,socket.SOCK_STREAM) , s.connect()
    #+END_SRC

2. 连接后发送数据和接收数据
   #+BEGIN_SRC python
        s.sendall(), s.recv()
   #+END_SRC 

3. 传输完毕后，关闭套接字
   #+BEGIN_SRC python
        s.close()
   #+END_SRC 

** python的socketserver学习
   *SocketServer* 模块简化了网络server的书写. *tcpserver* 使用tcp协议,UDPserver使用udp协议.他们和其余的两个unixStreamServer和UnixDatagramServerclass是相似的.不过后者是在类unix系统下使用.

   这四个类是利用同步方式进行请求处理的.也就是说每一个请求处理完成之后,下一个请求才会被处理.所以对于一个长时间的请求环境是非常不合适的. *ForkingMixIn* 和 *ThreadingMixIn* 可以被用来支持异步请求.

   创建服务器的步骤。首先，你必须创建一个请求处理类，它是BaseRequestHandler的子类并重载其handle()方法,这个方法涌来处理进入的请求。其次，你必须实例化一个服务器类，传入服务器的地址和请求处理程序类。最后，调用handle_request()(一般是调用其他事件循环或者使用select())或serve_forever()来处理一个或者多个请求。最后调用server_close()来关闭这个socket.

   继承 *ThreadingMixIn* 来处理线程请求.你应该进行线程异常中断的处理.threadingmixin类定义一个属性daemon_threads,用来处理是否等待线程中断.
  

   无论用什么网络协议，服务器类有相同的外部方法和属性。

   该模块在python3中已经更名为socketserver。

*** server 创建指导
    在socketserver中有5个server类,其中只有四个子类对外提供服务.BaseServer定义了server所需的基本函数.

    #+BEGIN_EXAMPLE
      +------------+
      | BaseServer |
      +------------+
            |
            v
      +-----------+        +------------------+
      | TCPServer |------->| UnixStreamServer |
      +-----------+        +------------------+
            |
            v
      +-----------+        +--------------------+
      | UDPServer |------->| UnixDatagramServer |
      +-----------+        +--------------------+
    #+END_EXAMPLE

