python/flask分析.html

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Socket函数</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>服务端函数
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">函数</th>
<th scope="col" class="left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">s.bind(address)</td>
<td class="left">将套结字绑定到地址,在AF_INET,以元素(host,port)的形式表示地址</td>
</tr>

<tr>
<td class="left">s.listen(backlog)</td>
<td class="left">开始监听TCP传入连接。backlog指定在拒绝连接之前，操作系统可以挂起的最大连接数量。该值至少为1，大部分应用程序设为5就可以了。</td>
</tr>

<tr>
<td class="left">s.accept()</td>
<td class="left">接受TCP连接并返回（conn,address）,其中conn是新的套接字对象，可以用来接收和发送数据。address是连接客户端的地址。</td>
</tr>
</tbody>
</table>
</li>

<li>客户端函数
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">函数</th>
<th scope="col" class="left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">s.connect(address)</td>
<td class="left">连接到address的套接字,一般address的格式为元组(hostname,port),如果链接出错,返回socket.error错误</td>
</tr>

<tr>
<td class="left">s.connect_ex(address)</td>
<td class="left">功能与connect(address)相同,但是成功返回0.失败返回error的值</td>
</tr>
</tbody>
</table>
</li>

<li>公共socket函数
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">函数</th>
<th scope="col" class="left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">s.recv(bufsize[,flag])</td>
<td class="left">接受TCP套接字的数据。数据以字符串形式返回，bufsize指定要接收的最大数据量。flag提供有关消息的其他信息，通常可以忽略。</td>
</tr>

<tr>
<td class="left">s.send(string[,flag])</td>
<td class="left">发送TCP数据。将string中的数据发送到连接的套接字。返回值是要发送的字节数量，该数量可能小于string的字节大小。</td>
</tr>

<tr>
<td class="left">s.sendall(string[,flag])</td>
<td class="left">完整发送TCP数据。将string中的数据发送到连接的套接字，但在返回之前会尝试发送所有数据。成功返回None，失败则抛出异常。</td>
</tr>

<tr>
<td class="left">s.recvfrom(bufsize[.flag])</td>
<td class="left">接受UDP套接字的数据。与recv()类似，但返回值是（data,address）。其中data是包含接收数据的字符串，address是发送数据的套接字地址。</td>
</tr>

<tr>
<td class="left">s.sendto(string[,flag],address)</td>
<td class="left">发送UDP数据。将数据发送到套接字，address是形式为（ipaddr，port）的元组，指定远程地址。返回值是发送的字节数。</td>
</tr>

<tr>
<td class="left">s.close()</td>
<td class="left">关闭套接字。</td>
</tr>

<tr>
<td class="left">s.getpeername()</td>
<td class="left">返回连接套接字的远程地址。返回值通常是元组（ipaddr,port）。</td>
</tr>

<tr>
<td class="left">s.getsockname()</td>
<td class="left">返回套接字自己的地址。通常是一个元组(ipaddr,port)</td>
</tr>

<tr>
<td class="left">s.setsockopt(level,optname,value)</td>
<td class="left">设置给定套接字选项的值。</td>
</tr>

<tr>
<td class="left">s.getsockopt(level,optname[.buflen])</td>
<td class="left">返回套接字选项的值。</td>
</tr>

<tr>
<td class="left">s.settimeout(timeout)</td>
<td class="left">设置套接字操作的超时期，timeout是一个浮点数，单位是秒。值为None表示没有超时期。一般，超时期应该在刚创建套接字时设置，因为它们可能用于连接的操作（如connect()）</td>
</tr>

<tr>
<td class="left">s.gettimeout()</td>
<td class="left">返回当前超时期的值，单位是秒，如果没有设置超时期，则返回None。</td>
</tr>

<tr>
<td class="left">s.fileno()</td>
<td class="left">返回套接字的文件描述符。</td>
</tr>

<tr>
<td class="left">s.setblocking(flag)</td>
<td class="left">如果flag为0，则将套接字设为非阻塞模式，否则将套接字设为阻塞模式（默认值）。非阻塞模式下，如果调用recv()没有发现任何数据，或send()调用无法立即发送数据，那么将引起socket.error异常。</td>
</tr>

<tr>
<td class="left">s.makefile()</td>
<td class="left">创建一个与该套接字相关连的文件</td>
</tr>
</tbody>
</table>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> socket 编程思路</h4>
<div class="outline-text-4" id="text-4-1-3">
</div><ol class="org-ol"><li><a id="sec-4-1-3-1" name="sec-4-1-3-1"></a>tcp服务器端<br  /><div class="outline-text-5" id="text-4-1-3-1">
<ol class="org-ol">
<li>创建套接字,绑定套接字到本地IP与端口
<div class="org-src-container">

<pre class="src src-python">socket.socket<span style="color: #2f96dc;">(</span>socket.AF_INET,socket.SOCK_STREAM<span style="color: #2f96dc;">)</span> , s.bind<span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>
<li>开始监听链接
<div class="org-src-container">

<pre class="src src-python">s.listen<span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>
<li>进入循环,不断接受客户端的连接请求
<div class="org-src-container">

<pre class="src src-python">s.accept<span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>
<li>然后接收传来的数据,并发送给对方数据
<div class="org-src-container">

<pre class="src src-python">s.recv<span style="color: #2f96dc;">()</span> , s.sendall<span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>
<li>传输完毕后,关闭套接字
<div class="org-src-container">

<pre class="src src-python">s.close<span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>
</ol>
</div>
</li>
<li><a id="sec-4-1-3-2" name="sec-4-1-3-2"></a>TCP 客户端<br  /><div class="outline-text-5" id="text-4-1-3-2">
<ol class="org-ol">
<li>创建套接字，连接远端地址
<div class="org-src-container">

<pre class="src src-python">socket.socket<span style="color: #2f96dc;">(</span>socket.AF_INET,socket.SOCK_STREAM<span style="color: #2f96dc;">)</span> , s.connect<span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>

<li>连接后发送数据和接收数据
<div class="org-src-container">

<pre class="src src-python">s.sendall<span style="color: #2f96dc;">()</span>, s.recv<span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>

<li>传输完毕后，关闭套接字
<div class="org-src-container">

<pre class="src src-python">s.close<span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>
</ol>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> python的socketserver学习</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<b>SocketServer</b> 模块简化了网络server的书写. <b>tcpserver</b> 使用tcp协议,UDPserver使用udp协议.他们和其余的两个unixStreamServer和UnixDatagramServerclass是相似的.不过后者是在类unix系统下使用.
</p>

<p>
这四个类是利用同步方式进行请求处理的.也就是说每一个请求处理完成之后,下一个请求才会被处理.所以对于一个长时间的请求环境是非常不合适的. <b>ForkingMixIn</b> 和 <b>ThreadingMixIn</b> 可以被用来支持异步请求.
</p>

<p>
创建服务器的步骤。首先，你必须创建一个请求处理类，它是BaseRequestHandler的子类并重载其handle()方法,这个方法涌来处理进入的请求。其次，你必须实例化一个服务器类，传入服务器的地址和请求处理程序类。最后，调用handle_request()(一般是调用其他事件循环或者使用select())或serve_forever()来处理一个或者多个请求。最后调用server_close()来关闭这个socket.
</p>

<p>
继承 <b>ThreadingMixIn</b> 来处理线程请求.你应该进行线程异常中断的处理.threadingmixin类定义一个属性daemon_threads,用来处理是否等待线程中断.
</p>


<p>
无论用什么网络协议，服务器类有相同的外部方法和属性。
</p>

<p>
该模块在python3中已经更名为socketserver。
</p>
</div>

<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> server 创建指导</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
在socketserver中有5个server类,其中只有四个子类对外提供服务.BaseServer定义了server所需的基本函数.
</p>

<pre class="example">
+------------+
| BaseServer |
+------------+
      |
      v
+-----------+        +------------------+
| TCPServer |-------&gt;| UnixStreamServer |
+-----------+        +------------------+
      |
      v
+-----------+        +--------------------+
| UDPServer |-------&gt;| UnixDatagramServer |
+-----------+        +--------------------+
</pre>
</div>
</div>
