python/flask分析.org
*** server 对象
+ class SocketServer.BaseServer
  这是模块中的所有服务器对象的超类。它定义了接口，如下所述，但是大多数的方法不实现，在子类中进行细化。

+ BaseServer.fileno()
  返回服务器监听套接字的整数文件描述符。通常用来传递给select.select(), 以允许一个进程监视多个服务器。

+ BaseServer.handle_request()
  处理单个请求。处理顺序：get_request(), verify_request(), process_request()。如果用户提供handle()方法抛出异常，将调用服务器的handle_error()方法。如果self.timeout内没有请求收到， 将调用handle_timeout()并返回handle_request()。

+ BaseServer.serve_forever(poll_interval=0.5)
  处理请求，直到一个明确的shutdown()请求。每poll_interval秒轮询一次shutdown。忽略self.timeout。如果你需要做周期性的任务，建议放置在其他线程。

+ BaseServer.shutdown()
  告诉serve_forever()循环停止并等待其停止。python2.6版本。

+ BaseServer.address_family
  地址家族，比如socket.AF_INET和socket.AF_UNIX。

+ BaseServer.RequestHandlerClass
  用户提供的请求处理类，这个类为每个请求创建实例。

+ BaseServer.server_address
  服务器侦听的地址。格式根据协议家族地址的各不相同，请参阅socket模块的文档。

+ BaseServer.socketSocket
  服务器上侦听传入的请求socket对象的服务器。

服务器类支持下面的类变量：

+ BaseServer.allow_reuse_address
  服务器是否允许地址的重用。默认为false ，并且可在子类中更改。

+ BaseServer.request_queue_size
  请求队列的大小。如果单个请求需要很长的时间来处理，服务器忙时请求被放置到队列中，最多可以放request_queue_size个。一旦队列已满，来自客户端的请求将得到 “Connection denied”错误。默认值通常为5 ，但可以被子类覆盖。

+ BaseServer.socket_type
  服务器使用的套接字类型; socket.SOCK_STREAM和socket.SOCK_DGRAM等。

+ BaseServer.timeout
  超时时间，以秒为单位，或 None表示没有超时。如果handle_request()在timeout内没有收到请求，将调用handle_timeout()。

下面方法可以被子类重载，它们对服务器对象的外部用户没有影响。

+ BaseServer.finish_request()
  实际处理RequestHandlerClass发起的请求并调用其handle()方法。 常用。

+ BaseServer.get_request()
  接受socket请求，并返回二元组包含要用于与客户端通信的新socket对象，以及客户端的地址。

+ BaseServer.handle_error(request, client_address)
  如果RequestHandlerClass的handle()方法抛出异常时调用。默认操作是打印traceback到标准输出，并继续处理其他请求。

+ BaseServer.handle_timeout()
  超时处理。默认对于forking服务器是收集退出的子进程状态，threading服务器则什么都不做。

+ BaseServer.process_request(request, client_address) 
  调用finish_request()创建RequestHandlerClass的实例。如果需要，此功能可以创建新的进程或线程来处理请求,ForkingMixIn和ThreadingMixIn类做到这点。常用。

+ BaseServer.server_activate()
  通过服务器的构造函数来激活服务器。默认的行为只是监听服务器套接字。可重载。

+ BaseServer.server_bind()
  通过服务器的构造函数中调用绑定socket到所需的地址。可重载。

+ BaseServer.verify_request(request, client_address)
  返回一个布尔值，如果该值为True ，则该请求将被处理，反之请求将被拒绝。此功能可以重写来实现对服务器的访问控制。默认的实现始终返回True。client_address可以限定客户端，比如只处理指定ip区间的请求。 常用。

*** 请求处理对象
    处理器接收数据并决定如何操作。它负责在socket层之上实现协议（i.e., HTTP, XML-RPC, or AMQP)，读取数据，处理并写反应。可以重载的方法如下：

    + setup()
      准备请求处理. 默认什么都不做，StreamRequestHandler中会创建文件类似的对象以读写socket.
    + handle()
      处理请求。解析传入的请求，处理数据，并发送响应。默认什么都不做。常用变量：self.request，self.client_address，self.server。
    + finish()
      环境清理。默认什么都不做，如果setup产生异常，不会执行finish。

*** socketserver实现:
    1. 利用socketserver实现请求的接收.
       然后进行请求的处理,
    2. 利用RequestHandlerClass进行请求的处理
       实现请求的处理

  
    
*** 代码解析

**** forve_forver()
     1. 源码:
        #+BEGIN_SRC python
              def serve_forever(self, poll_interval=0.5):
                  """Handle one request at a time until shutdown.

                  Polls for shutdown every poll_interval seconds. Ignores
                  self.timeout. If you need to do periodic tasks, do them in
                  another thread.
                  """
                  self.__is_shut_down.clear()
                  try:
                      while not self.__shutdown_request:
                          # XXX: Consider using another file descriptor or
                          # connecting to the socket to wake this up instead of
                          # polling. Polling reduces our responsiveness to a
                          # shutdown request and wastes cpu at all other times.
                          r, w, e = _eintr_retry(select.select, [self], [], [],
                                                 poll_interval)
                          if self in r:
                              self._handle_request_noblock()
                  finally:
                      self.__shutdown_request = False
                      self.__is_shut_down.set()

        #+END_SRC

     2. 解析:
        阻塞式的请求.
        通过不断调用select函数，看看自己是否处于可写状态，如果是就调用_handle_request_noblock()，
        这里有一个问题select函数操作集合的时候有个要求，要么集合本身是描述符，要么他提供一个fileno()接口，
        返回一个描述符，查找TCPServer的成员函数确实存在这样一个函数，它返回socket的描述符.

**** handle_request()
     1. 源码
        #+BEGIN_SRC python
              def handle_request(self):
                  """Handle one request, possibly blocking.

                  Respects self.timeout.
                  """
                  # Support people who used socket.settimeout() to escape
                  # handle_request before self.timeout was available.
                  timeout = self.socket.gettimeout()
                  if timeout is None:
                      timeout = self.timeout
                  elif self.timeout is not None:
                      timeout = min(timeout, self.timeout)
                  fd_sets = _eintr_retry(select.select, [self], [], [], timeout)
                  if not fd_sets[0]:
                      self.handle_timeout()
                      return
                  self._handle_request_noblock()

        #+END_SRC

     2. 解析
        仅仅处理一个请求,通过select.select实现在 self.timeout时间内的监听.但是仅仅处理 *一个* 请求.是serve_forever()的简化版.
