python/flask分析.html

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> server 对象</h4>
<div class="outline-text-4" id="text-4-2-2">
<ul class="org-ul">
<li>class SocketServer.BaseServer
这是模块中的所有服务器对象的超类。它定义了接口，如下所述，但是大多数的方法不实现，在子类中进行细化。
</li>

<li>BaseServer.fileno()
返回服务器监听套接字的整数文件描述符。通常用来传递给select.select(), 以允许一个进程监视多个服务器。
</li>

<li>BaseServer.handle_request()
处理单个请求。处理顺序：get_request(), verify_request(), process_request()。如果用户提供handle()方法抛出异常，将调用服务器的handle_error()方法。如果self.timeout内没有请求收到， 将调用handle_timeout()并返回handle_request()。
</li>

<li>BaseServer.serve_forever(poll_interval=0.5)
处理请求，直到一个明确的shutdown()请求。每poll_interval秒轮询一次shutdown。忽略self.timeout。如果你需要做周期性的任务，建议放置在其他线程。
</li>

<li>BaseServer.shutdown()
告诉serve_forever()循环停止并等待其停止。python2.6版本。
</li>

<li>BaseServer.address_family
  地址家族，比如socket.AF_INET和socket.AF_UNIX。
</li>

<li>BaseServer.RequestHandlerClass
用户提供的请求处理类，这个类为每个请求创建实例。
</li>

<li>BaseServer.server_address
  服务器侦听的地址。格式根据协议家族地址的各不相同，请参阅socket模块的文档。
</li>

<li>BaseServer.socketSocket
服务器上侦听传入的请求socket对象的服务器。
</li>
</ul>

<p>
服务器类支持下面的类变量：
</p>

<ul class="org-ul">
<li>BaseServer.allow_reuse_address
  服务器是否允许地址的重用。默认为false ，并且可在子类中更改。
</li>

<li>BaseServer.request_queue_size
  请求队列的大小。如果单个请求需要很长的时间来处理，服务器忙时请求被放置到队列中，最多可以放request_queue_size个。一旦队列已满，来自客户端的请求将得到 “Connection denied”错误。默认值通常为5 ，但可以被子类覆盖。
</li>

<li>BaseServer.socket_type
  服务器使用的套接字类型; socket.SOCK_STREAM和socket.SOCK_DGRAM等。
</li>

<li>BaseServer.timeout
超时时间，以秒为单位，或 None表示没有超时。如果handle_request()在timeout内没有收到请求，将调用handle_timeout()。
</li>
</ul>

<p>
下面方法可以被子类重载，它们对服务器对象的外部用户没有影响。
</p>

<ul class="org-ul">
<li>BaseServer.finish_request()
实际处理RequestHandlerClass发起的请求并调用其handle()方法。 常用。
</li>

<li>BaseServer.get_request()
接受socket请求，并返回二元组包含要用于与客户端通信的新socket对象，以及客户端的地址。
</li>

<li>BaseServer.handle_error(request, client_address)
如果RequestHandlerClass的handle()方法抛出异常时调用。默认操作是打印traceback到标准输出，并继续处理其他请求。
</li>

<li>BaseServer.handle_timeout()
超时处理。默认对于forking服务器是收集退出的子进程状态，threading服务器则什么都不做。
</li>

<li>BaseServer.process_request(request, client_address) 
调用finish_request()创建RequestHandlerClass的实例。如果需要，此功能可以创建新的进程或线程来处理请求,ForkingMixIn和ThreadingMixIn类做到这点。常用。
</li>

<li>BaseServer.server_activate()
通过服务器的构造函数来激活服务器。默认的行为只是监听服务器套接字。可重载。
</li>

<li>BaseServer.server_bind()
通过服务器的构造函数中调用绑定socket到所需的地址。可重载。
</li>

<li>BaseServer.verify_request(request, client_address)
返回一个布尔值，如果该值为True ，则该请求将被处理，反之请求将被拒绝。此功能可以重写来实现对服务器的访问控制。默认的实现始终返回True。client_address可以限定客户端，比如只处理指定ip区间的请求。 常用。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> 请求处理对象</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
处理器接收数据并决定如何操作。它负责在socket层之上实现协议（i.e., HTTP, XML-RPC, or AMQP)，读取数据，处理并写反应。可以重载的方法如下：
</p>

<ul class="org-ul">
<li>setup()
准备请求处理. 默认什么都不做，StreamRequestHandler中会创建文件类似的对象以读写socket.
</li>
<li>handle()
处理请求。解析传入的请求，处理数据，并发送响应。默认什么都不做。常用变量：self.request，self.client_address，self.server。
</li>
<li>finish()
环境清理。默认什么都不做，如果setup产生异常，不会执行finish。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> socketserver实现:</h4>
<div class="outline-text-4" id="text-4-2-4">
<ol class="org-ol">
<li>利用socketserver实现请求的接收.
然后进行请求的处理,
</li>
<li>利用RequestHandlerClass进行请求的处理
实现请求的处理
</li>
</ol>
</div>
</div>



<div id="outline-container-sec-4-2-5" class="outline-4">
<h4 id="sec-4-2-5"><span class="section-number-4">4.2.5</span> 代码解析</h4>
<div class="outline-text-4" id="text-4-2-5">
</div><ol class="org-ol"><li><a id="sec-4-2-5-1" name="sec-4-2-5-1"></a>forve_forver()<br  /><div class="outline-text-5" id="text-4-2-5-1">
<ol class="org-ol">
<li>源码:
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">serve_forever</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, poll_interval=<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">5</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #2aa198;">"""Handle one request at a time until shutdown.</span>

<span style="color: #2aa198;">    Polls for shutdown every poll_interval seconds. Ignores</span>
<span style="color: #2aa198;">    self.timeout. If you need to do periodic tasks, do them in</span>
<span style="color: #2aa198;">    another thread.</span>
<span style="color: #2aa198;">    """</span>
    <span style="color: #237fbf; font-weight: bold;">self</span>.__is_shut_down.clear<span style="color: #2f96dc;">()</span>
    <span style="color: #237fbf; font-weight: bold;">try</span>:
        <span style="color: #237fbf; font-weight: bold;">while</span> <span style="color: #237fbf; font-weight: bold;">not</span> <span style="color: #237fbf; font-weight: bold;">self</span>.__shutdown_request:
            <span style="color: #2aa198;"># </span><span style="color: #2aa198;">XXX: Consider using another file descriptor or</span>
            <span style="color: #2aa198;"># </span><span style="color: #2aa198;">connecting to the socket to wake this up instead of</span>
            <span style="color: #2aa198;"># </span><span style="color: #2aa198;">polling. Polling reduces our responsiveness to a</span>
            <span style="color: #2aa198;"># </span><span style="color: #2aa198;">shutdown request and wastes cpu at all other times.</span>
            <span style="color: #adaab3;">r</span>, <span style="color: #adaab3;">w</span>, <span style="color: #adaab3;">e</span> = _eintr_retry<span style="color: #2f96dc;">(</span>select.select, <span style="color: #bc6ec5;">[</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #bc6ec5;">]</span>, <span style="color: #bc6ec5;">[]</span>, <span style="color: #bc6ec5;">[]</span>,
                                   poll_interval<span style="color: #2f96dc;">)</span>
            <span style="color: #237fbf; font-weight: bold;">if</span> <span style="color: #237fbf; font-weight: bold;">self</span> <span style="color: #237fbf; font-weight: bold;">in</span> r:
                <span style="color: #237fbf; font-weight: bold;">self</span>._handle_request_noblock<span style="color: #2f96dc;">()</span>
    <span style="color: #237fbf; font-weight: bold;">finally</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.__shutdown_request = <span style="color: #a45bad;">False</span>
        <span style="color: #237fbf; font-weight: bold;">self</span>.__is_shut_down.<span style="color: #1f71ab;">set</span><span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>

<li>解析:
阻塞式的请求.
通过不断调用select函数，看看自己是否处于可写状态，如果是就调用_handle_request_noblock()，
这里有一个问题select函数操作集合的时候有个要求，要么集合本身是描述符，要么他提供一个fileno()接口，
返回一个描述符，查找TCPServer的成员函数确实存在这样一个函数，它返回socket的描述符.
</li>
</ol>
</div>
</li>

<li><a id="sec-4-2-5-2" name="sec-4-2-5-2"></a>handle_request()<br  /><div class="outline-text-5" id="text-4-2-5-2">
<ol class="org-ol">
<li>源码
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">handle_request</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #2aa198;">"""Handle one request, possibly blocking.</span>

<span style="color: #2aa198;">    Respects self.timeout.</span>
<span style="color: #2aa198;">    """</span>
    <span style="color: #2aa198;"># </span><span style="color: #2aa198;">Support people who used socket.settimeout() to escape</span>
    <span style="color: #2aa198;"># </span><span style="color: #2aa198;">handle_request before self.timeout was available.</span>
    <span style="color: #adaab3;">timeout</span> = <span style="color: #237fbf; font-weight: bold;">self</span>.socket.gettimeout<span style="color: #2f96dc;">()</span>
    <span style="color: #237fbf; font-weight: bold;">if</span> timeout <span style="color: #237fbf; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>:
        <span style="color: #adaab3;">timeout</span> = <span style="color: #237fbf; font-weight: bold;">self</span>.timeout
    <span style="color: #237fbf; font-weight: bold;">elif</span> <span style="color: #237fbf; font-weight: bold;">self</span>.timeout <span style="color: #237fbf; font-weight: bold;">is</span> <span style="color: #237fbf; font-weight: bold;">not</span> <span style="color: #a45bad;">None</span>:
        <span style="color: #adaab3;">timeout</span> = <span style="color: #1f71ab;">min</span><span style="color: #2f96dc;">(</span>timeout, <span style="color: #237fbf; font-weight: bold;">self</span>.timeout<span style="color: #2f96dc;">)</span>
    <span style="color: #adaab3;">fd_sets</span> = _eintr_retry<span style="color: #2f96dc;">(</span>select.select, <span style="color: #bc6ec5;">[</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #bc6ec5;">]</span>, <span style="color: #bc6ec5;">[]</span>, <span style="color: #bc6ec5;">[]</span>, timeout<span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">if</span> <span style="color: #237fbf; font-weight: bold;">not</span> fd_sets<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">0</span><span style="color: #2f96dc;">]</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.handle_timeout<span style="color: #2f96dc;">()</span>
        <span style="color: #237fbf; font-weight: bold;">return</span>
    <span style="color: #237fbf; font-weight: bold;">self</span>._handle_request_noblock<span style="color: #2f96dc;">()</span>
</pre>
</div>
</li>

<li>解析
仅仅处理一个请求,通过select.select实现在 self.timeout时间内的监听.但是仅仅处理 <b>一个</b> 请求.是serve_forever()的简化版.
</li>
</ol>
</div>
</li>
