python/flask分析.org
**** _handle_request_noblock()
    + 源码:
      #+BEGIN_SRC python
                  def _handle_request_noblock(self):
                """Handle one request, without blocking.

                I assume that select.select has returned that the socket is
                readable before this function was called, so there should be
                no risk of blocking in get_request().
                """
                try:
                    request, client_address = self.get_request()
                except socket.error:
                    return
                if self.verify_request(request, client_address):
                    try:
                        self.process_request(request, client_address)
                    except:
                        self.handle_error(request, client_address)
                        self.shutdown_request(request)

      #+END_SRC

    + 解析
      在这个函数重要是进行了三个函数的判断:
      1. self.get_request()

      2. self.verify_request(request, client_address)

      3. self.process_request(request, client_address)
         调用self.finish_request(request, client_address),从而实现对于RequestHandlerClass的调用,实现请求的处理.
      这个函数是所有函数处理的中心,但是要明白这个函数时阻塞式的.
     
      在BaseSocketserver中,有两个函数调用了它,一个是 serve_forever,另外一个是handle_request,这两个函数也是处理请求所以必须的函数.
**** ForkingMixIn
     1. 重写了 BaseServer的函数handle_timeout(self) 和函数process_request(self, request, client_address).
