python/flask分析.html
<li><a id="sec-4-2-5-3" name="sec-4-2-5-3"></a>_handle_request_noblock()<br  /><div class="outline-text-5" id="text-4-2-5-3">
<ul class="org-ul">
<li>源码:
<div class="org-src-container">

<pre class="src src-python">  <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">_handle_request_noblock</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
<span style="color: #2aa198;">"""Handle one request, without blocking.</span>

<span style="color: #2aa198;">I assume that select.select has returned that the socket is</span>
<span style="color: #2aa198;">readable before this function was called, so there should be</span>
<span style="color: #2aa198;">no risk of blocking in get_request().</span>
<span style="color: #2aa198;">"""</span>
<span style="color: #237fbf; font-weight: bold;">try</span>:
    <span style="color: #adaab3;">request</span>, <span style="color: #adaab3;">client_address</span> = <span style="color: #237fbf; font-weight: bold;">self</span>.get_request<span style="color: #2f96dc;">()</span>
<span style="color: #237fbf; font-weight: bold;">except</span> socket.error:
    <span style="color: #237fbf; font-weight: bold;">return</span>
<span style="color: #237fbf; font-weight: bold;">if</span> <span style="color: #237fbf; font-weight: bold;">self</span>.verify_request<span style="color: #2f96dc;">(</span>request, client_address<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">try</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.process_request<span style="color: #2f96dc;">(</span>request, client_address<span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">except</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.handle_error<span style="color: #2f96dc;">(</span>request, client_address<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">self</span>.shutdown_request<span style="color: #2f96dc;">(</span>request<span style="color: #2f96dc;">)</span>
</pre>
</div>
</li>

<li>解析
在这个函数重要是进行了三个函数的判断:
<ol class="org-ol">
<li>self.get_request()
</li>

<li>self.verify_request(request, client_address)
</li>

<li>self.process_request(request, client_address)
调用self.finish_request(request, client_address),从而实现对于RequestHandlerClass的调用,实现请求的处理.
</li>
</ol>
<p>
这个函数是所有函数处理的中心,但是要明白这个函数时阻塞式的.
</p>

<p>
在BaseSocketserver中,有两个函数调用了它,一个是 serve_forever,另外一个是handle_request,这两个函数也是处理请求所以必须的函数.
</p>
</li>
</ul>
</div>
</li>
<li><a id="sec-4-2-5-4" name="sec-4-2-5-4"></a>ForkingMixIn<br  /><div class="outline-text-5" id="text-4-2-5-4">
<ol class="org-ol">
<li>重写了 BaseServer的函数handle_timeout(self) 和函数process_request(self, request, client_address).
</li>
</ol>
</div>
</li></ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: huihui</p>
<p class="date">Created: 2015-11-30 一 10:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
